Tests/Morix_Java-v5.1/jmeter/plan_test-ex5-charge.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.0 r1840935">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Plan de test - charge" enabled="true">
      <stringProp name="TestPlan.comments">Plan de test avec un groupe d&apos;unités, montée en charge</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="TCPConfigGui" testclass="ConfigTestElement" testname="Paramètres TCP par défaut : ex. connexion Morix" enabled="true">
        <stringProp name="TCPSampler.server">127.0.0.1</stringProp>
        <boolProp name="TCPSampler.reUseConnection">true</boolProp>
        <stringProp name="TCPSampler.port">13579</stringProp>
        <boolProp name="TCPSampler.nodelay">false</boolProp>
        <stringProp name="TCPSampler.timeout">500</stringProp>
        <stringProp name="TestPlan.comments">Connexion au serveur Morix.</stringProp>
        <stringProp name="TCPSampler.classname">morix.TCPClientMorixImpl</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables pré-définies : ex. protocole" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="DONNE_PRODUITS" elementType="Argument">
            <stringProp name="Argument.name">DONNE_PRODUITS</stringProp>
            <stringProp name="Argument.value">/P</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">commande client -&gt; serveur (monix -&gt; morix)</stringProp>
          </elementProp>
          <elementProp name="INSCRIPTION_CLIENT" elementType="Argument">
            <stringProp name="Argument.name">INSCRIPTION_CLIENT</stringProp>
            <stringProp name="Argument.value">/I</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">commande client -&gt; serveur (monix -&gt; morix)</stringProp>
          </elementProp>
          <elementProp name="CHANGE_QUANTITE_PRODUIT" elementType="Argument">
            <stringProp name="Argument.name">CHANGE_QUANTITE_PRODUIT</stringProp>
            <stringProp name="Argument.value">/c</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">commande client -&gt; serveur (monix -&gt; morix)</stringProp>
          </elementProp>
          <elementProp name="MODIFIE_QUANTITE_PRODUIT" elementType="Argument">
            <stringProp name="Argument.name">MODIFIE_QUANTITE_PRODUIT</stringProp>
            <stringProp name="Argument.value">/q</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">commande serveur -&gt; client (morix -&gt; monix)</stringProp>
          </elementProp>
          <elementProp name="SEPARATEUR_CHAMPS_PRODUIT" elementType="Argument">
            <stringProp name="Argument.name">SEPARATEUR_CHAMPS_PRODUIT</stringProp>
            <stringProp name="Argument.value">:::</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">utilisé dans les commandes</stringProp>
          </elementProp>
          <elementProp name="SEPARATEUR_PRODUITS" elementType="Argument">
            <stringProp name="Argument.name">SEPARATEUR_PRODUITS</stringProp>
            <stringProp name="Argument.value">///</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">utilisé dans les commandes</stringProp>
          </elementProp>
          <elementProp name="MESSAGE_INSCRIPTION" elementType="Argument">
            <stringProp name="Argument.name">MESSAGE_INSCRIPTION</stringProp>
            <stringProp name="Argument.value">Inscription OK</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">message serveur -&gt; client</stringProp>
          </elementProp>
          <elementProp name="MESSAGE_ERREUR" elementType="Argument">
            <stringProp name="Argument.name">MESSAGE_ERREUR</stringProp>
            <stringProp name="Argument.value">Erreur Morix : </stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">message serveur -&gt; client</stringProp>
          </elementProp>
        </collectionProp>
        <stringProp name="TestPlan.comments">Variables du protocole de communication avec le serveur Morix.</stringProp>
      </Arguments>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Groupe d&apos;unités de tests : ex. montée en charge" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Contrôleur Boucle" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">600</stringProp>
        <stringProp name="ThreadGroup.ramp_time">60</stringProp>
        <longProp name="ThreadGroup.start_time">1326834645000</longProp>
        <longProp name="ThreadGroup.end_time">1326834645000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="TestPlan.comments">Groupe d&apos;unités de test du serveur Morix - exemple de montée charge</stringProp>
      </ThreadGroup>
      <hashTree>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables pré-définies : données de test" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="ID_PRODUIT" elementType="Argument">
              <stringProp name="Argument.name">ID_PRODUIT</stringProp>
              <stringProp name="Argument.value">11A</stringProp>
              <stringProp name="Argument.desc">identifiant du produit utilisé pour les tests</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="QTT_DECREMENT" elementType="Argument">
              <stringProp name="Argument.name">QTT_DECREMENT</stringProp>
              <stringProp name="Argument.value">-1</stringProp>
              <stringProp name="Argument.desc">quantité de produit à enlever du stock</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="QTT_INCREMENT" elementType="Argument">
              <stringProp name="Argument.name">QTT_INCREMENT</stringProp>
              <stringProp name="Argument.value">1</stringProp>
              <stringProp name="Argument.desc">quantité de produit à ajouter au stock</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Compteur de temps fixe" enabled="true">
          <stringProp name="ConstantTimer.delay">500</stringProp>
        </ConstantTimer>
        <hashTree/>
        <TCPSampler guiclass="TCPSamplerGui" testclass="TCPSampler" testname="Requête TCP - Inscription client" enabled="true">
          <stringProp name="TestPlan.comments">Inscription d&apos;un client au canal de diffusion des informations de Morix.</stringProp>
          <boolProp name="TCPSampler.reUseConnection">true</boolProp>
          <boolProp name="TCPSampler.nodelay">false</boolProp>
          <stringProp name="TCPSampler.request">${INSCRIPTION_CLIENT}</stringProp>
        </TCPSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assertion Réponse" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="78399604">${MESSAGE_INSCRIPTION}</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <TCPSampler guiclass="TCPSamplerGui" testclass="TCPSampler" testname="Requête TCP - Décrémente quantité" enabled="true">
          <stringProp name="TestPlan.comments">Test de décrément d&apos;une quantité du produit (cf. variables prédéfinies)</stringProp>
          <boolProp name="TCPSampler.reUseConnection">true</boolProp>
          <boolProp name="TCPSampler.nodelay">false</boolProp>
          <stringProp name="TCPSampler.request">${CHANGE_QUANTITE_PRODUIT} ${ID_PRODUIT}${SEPARATEUR_CHAMPS_PRODUIT}${QTT_DECREMENT}</stringProp>
        </TCPSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assertion Réponse" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1227142105">${MODIFIE_QUANTITE_PRODUIT} ${ID_PRODUIT}${SEPARATEUR_CHAMPS_PRODUIT}</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <TCPSampler guiclass="TCPSamplerGui" testclass="TCPSampler" testname="Requête TCP - Incrémente quantité" enabled="true">
          <stringProp name="TestPlan.comments">Test d&apos;incrément d&apos;une quantité du produit (cf. variables prédéfinies)</stringProp>
          <boolProp name="TCPSampler.reUseConnection">true</boolProp>
          <boolProp name="TCPSampler.nodelay">false</boolProp>
          <stringProp name="TCPSampler.request">${CHANGE_QUANTITE_PRODUIT} ${ID_PRODUIT}${SEPARATEUR_CHAMPS_PRODUIT}${QTT_INCREMENT}</stringProp>
        </TCPSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assertion Réponse" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1227142105">${MODIFIE_QUANTITE_PRODUIT} ${ID_PRODUIT}${SEPARATEUR_CHAMPS_PRODUIT}</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Graphique évolution temps de réponses" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="RespTimeGraph.interval">1000</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graphique de résultats" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>